haywoodsloan/esp32-s3-eye-birdnet/sdkconfig.defaults
# =============================================================================
# Default sdkconfig for the ESP32-S3-EYE BirdNET firmware.
# These values are applied on first configure; tweak via `idf.py menuconfig`.
# =============================================================================

# ---- Target -----------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash (ESP32-S3-EYE ships with 8 MB) -----------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- Octal PSRAM (8 MB) -----------------------------------------------------
# The audio buffers, mel filterbank, spectrogram, LVGL canvas and the
# TFLite-Micro tensor arena are all allocated from PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- WiFi memory footprint --------------------------------------------------
# WiFi comes up late (after the model, LVGL, audio and STFT have taken internal
# RAM) and is only used for a brief SNTP time sync. The default 16 static RX
# buffers must live in DMA-capable INTERNAL RAM and were exhausting it, so
# esp_wifi_init() failed with ESP_ERR_NO_MEM ("Expected to init 16 rx buffer,
# actual is 7"). Shrink the static RX pool (dynamic RX/TX still go to PSRAM via
# TRY_ALLOCATE_WIFI_LWIP above); plenty for associate + DHCP + a few NTP packets.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
# The AMPDU RX block-ack window must be <= 2x the static RX buffers (enforced by
# a build-time #error in wifi_init.c), so shrink it to match the smaller pool.
CONFIG_ESP_WIFI_RX_BA_WIN=8

# ---- CPU --------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# ---- I2S audio --------------------------------------------------------------
# Keep the I2S DMA ISR in IRAM so microphone capture is not stalled by flash
# cache misses (e.g. during SD-card model swaps), avoiding audio glitches.
CONFIG_I2S_ISR_IRAM_SAFE=y

# ---- Compiler ---------------------------------------------------------------
# -O2 keeps the DSP / inference hot paths fast.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ---- Partition table --------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- FATFS (microSD model storage) ------------------------------------------
# Long filenames are REQUIRED: the ".tflite" extension alone is 6 chars, which
# exceeds the FAT 8.3 limit, so SD model files won't open without LFN.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# ---- Main task --------------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---- Task watchdog: give long inference invokes some slack ------------------
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# ---- LVGL -------------------------------------------------------------------
# The bundled UI fonts (main/ui/assets/roboto_*.c) are emitted by lv_font_conv
# with RLE-compressed glyph bitmaps (bitmap_format = LV_FONT_FMT_TXT_COMPRESSED).
# Without this option the compressed-glyph decoder is not compiled in, so every
# glyph decodes to nothing and ALL text is invisible while images/shapes still
# render. Enable it so the detection-overlay name + confidence text show.
CONFIG_LV_USE_FONT_COMPRESSED=y
